In [1]:
import pandas as pd

# Series

In [2]:
data = [1,2,3,4,5]

In [3]:
s = pd.Series(data)

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index = ['linha ' + str(i) for i in range(5)]

In [6]:
index

['linha 0', 'linha 1', 'linha 2', 'linha 3', 'linha 4']

In [7]:
s = pd.Series(data=data, index=index)
s

linha 0    1
linha 1    2
linha 2    3
linha 3    4
linha 4    5
dtype: int64

## Dicion√°rio

In [9]:
data = {'linha ' + str(i) : i + 1 for i in range(5)}
data

{'linha 0': 1, 'linha 1': 2, 'linha 2': 3, 'linha 3': 4, 'linha 4': 5}

In [10]:
s = pd.Series(data)
s

linha 0    1
linha 1    2
linha 2    3
linha 3    4
linha 4    5
dtype: int64

In [11]:
s1 = s + 2
s1

linha 0    3
linha 1    4
linha 2    5
linha 3    6
linha 4    7
dtype: int64

In [12]:
s2 = s + s1
s2

linha 0     4
linha 1     6
linha 2     8
linha 3    10
linha 4    12
dtype: int64

## DataFrame

In [13]:
data = [[1,2,3], 
        [4,5,6], 
        [7,8,9]]

In [14]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [17]:
df1 = pd.DataFrame(data = data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [18]:
index = [ 'Linha ' + str(i) for i in range(3)]
index

['Linha 0', 'Linha 1', 'Linha 2']

In [19]:
df1 = pd.DataFrame(data = data, index = index)
df1

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [20]:
columns = [ 'Coluna ' + str(i) for i in range(3)]
columns

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [21]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [22]:
data = {'Coluna 0' : {'Linha 0' : 1, 'Linha 1' : 4, 'Linha 2' : 7},
 'Coluna 1' : {'Linha 0' : 2, 'Linha 1' : 5, 'Linha 2' : 8},
 'Coluna 2' : {'Linha 0' : 3, 'Linha 1' : 6, 'Linha 2' : 9}}

In [23]:
data

{'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
 'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
 'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [24]:
df2 = pd.DataFrame(data)
df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [28]:
data = [(1,2,3), 
        (4,5,6), 
        (7,8,9)]

In [29]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [30]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

## concatenar DataFrame

In [32]:
df1[df1 > 0] = 'A'
df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [33]:
df2[df2 > 0] = 'B'
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [34]:
df3[df3 > 0] = 'C'
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [35]:
df4 = pd.concat([df1, df2, df3])
df4

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [36]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C

In [37]:
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [38]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [39]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [40]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4